УТ_для_edt/src/Catalogs/смартМодулиПечатныхФорм/смартМодулиПечатныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартМодулиПечатныхФорм</name>
  <comment>#Б-3164 смарт: Лопато 20.05.2025 //Печать договора из Заказа клиента. Функциональное описание новой обработки.</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РазрывСтраницыWord</name>
      <description>Разрыв страницы Word</description>
    </items>
  </predefined>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Макет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>#Б-3746 смарт: Лопато 08.07.2025 //Справочник Модули печатных форм (смарт). Доработка. </comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаМакета</name>
    <comment>#Б-3746 смарт: Лопато 08.07.2025 //Справочник Модули печатных форм (смарт). Доработка. </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоваяСтраница</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМодуля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрВложенногоМодуля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбласти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрОбласти</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьОсновнойМакет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсточникиДанных</name>
    <attributes>
      <name>ИсточникДанных</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыШаблона</name>
    <attributes>
      <name>ПараметрШаблона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>450</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Формат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроизвольныйКод</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбластиШаблона</name>
    <attributes>
      <name>ОбластьШаблона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВывода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитКоллекцииЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПараметровМакета</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокОбластейМакета</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеМодули</name>
    <attributes>
      <name>Модуль</name>
      <type>
        <types>CatalogRef.смартМодулиПечатныхФорм</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеПечати</name>
      <type>
        <types>CatalogRef.смартАлгоритмыПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяОбласти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрОбласти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитКоллекцииЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/InformationRegisters/смартДополнительныеДанныеОбъектов/смартДополнительныеДанныеОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартДополнительныеДанныеОбъектов</name>
  <comment>//++ #Б3014 смарт: Шляпников 15.05.2025 / Интеграция с WMS. Атлант. Приемка. Разработка</comment>
  <resources>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Catalogs/смартМодулиПечатныхФорм/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда
		
		Объект.ТипМакета = "DOCX";
		
		Объект.Ответственный = Пользователи.АвторизованныйПользователь();	
		
	КонецЕсли;	
	
	ТекущийТипМакета = Объект.ТипМакета;
	
	ЗаполнитьСписокВыбораОбластей();

	ВывестиДанныеМакетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()

	Элементы.ЗагрузитьМакет.Видимость = Объект.ТипМакета = "DOCX";
	
КонецПроцедуры	

&НаСервере
Процедура ВывестиДанныеМакетаНаСервере()

	Если Объект.Ссылка.Пустая() Тогда

		ЕстьМакет = Ложь;

	Иначе
		
		МакетМодуля = смартСерверПривилегированный.ПолучитьДополнительныеДанныеОбъекта(Объект.Ссылка);
		
		ЕстьМакет = МакетМодуля <> Неопределено;
		
	КонецЕсли;	
	
	Элементы.ДекорацияЕстьМакет.Видимость = ЕстьМакет;

	Если ЕстьМакет Тогда

		Если Объект.ТипМакета = "DOCX"
			И ЗначениеЗаполнено(Объект.ИмяФайлаМакета) Тогда
			
			Элементы.ДекорацияИмяФайла.Заголовок = СокрЛП(Объект.ИмяФайлаМакета);
			
		Иначе
			
			Элементы.ДекорацияИмяФайла.Заголовок = "";
			
		КонецЕсли;	
				
		Если ЗначениеЗаполнено(Объект.ДатаИзменения) Тогда

			Элементы.ДекорацияИзменен.Заголовок  = "Изменен: " + Формат(Объект.ДатаИзменения, "ДЛФ=DDT");

		Иначе
			
			Элементы.ДекорацияИзменен.Заголовок  = "";
			
		КонецЕсли;	
		
	Иначе
		
		Элементы.ДекорацияИмяФайла.Заголовок = "";
		Элементы.ДекорацияИзменен.Заголовок  = "";
		
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьМакет(Команда)

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала модуль нужно записать!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнено наименование!");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.ТипМакета) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен тип макета!");
		Возврат;
	КонецЕсли;
	
	ПараметрыМакета = Новый Структура("Копирование, ТипМакета", Ложь, Объект.ТипМакета);

	ПриРедактированииМакета(Объект.Наименование, ПараметрыМакета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриРедактированииМакета(ИмяМакета, ПараметрыМакета) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ТипМакета",    		 ПараметрыМакета.ТипМакета);
	ПараметрыОткрытия.Вставить("Владелец",	   		 Объект.Ссылка);
	ПараметрыОткрытия.Вставить("Ссылка", 		  	 Объект.Ссылка);
	ПараметрыОткрытия.Вставить("ИсточникДанных",  	 Объект.ИсточникДанных);
	ПараметрыОткрытия.Вставить("ИсточникиДанных", 	 Объект.ИсточникиДанных);
	ПараметрыОткрытия.Вставить("ЭтоПечатнаяФорма",   Истина);
	ПараметрыОткрытия.Вставить("ДоступноНазначение", Истина);
	ПараметрыОткрытия.Вставить("ИмяДокумента", 		 ?(ЗначениеЗаполнено(Объект.ИмяФайлаМакета), 
													   СтрЗаменить(Объект.ИмяФайлаМакета, ".docx", ""), 
													   Объект.Наименование));
	
	СохраненныйМакет = смартСерверПривилегированный.ПолучитьДополнительныеДанныеОбъекта(Объект.Ссылка);
	
	Если ПараметрыМакета.ТипМакета = "MXL" Тогда
		
		Если СохраненныйМакет <> Неопределено Тогда
			ПараметрыОткрытия.Вставить("ТабличныйДокумент", СохраненныйМакет);
		КонецЕсли;	
		
		ПараметрыОткрытия.Вставить("Редактирование", Истина);
		ОткрытьФорму("ОбщаяФорма.смартРедактированиеТабличногоДокумента", ПараметрыОткрытия, ЭтотОбъект);
		Возврат;
	
	ИначеЕсли ПараметрыМакета.ТипМакета = "DOCX" Тогда

		Если СохраненныйМакет <> Неопределено Тогда
			ПараметрыОткрытия.Вставить("АдресФайлаМакета", ПоместитьВоВременноеХранилище(СохраненныйМакет));
		КонецЕсли;	
		
		ПараметрыОткрытия.Вставить("Редактирование", Истина);
		ОткрытьФорму("ОбщаяФорма.смартРедактированиеДокументаOfficeOpen", ПараметрыОткрытия, ЭтотОбъект);
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуМетаданныхЗавершение", ЭтаФорма, Параметры);
	ОткрытьФорму("Справочник.смартМодулиПечатныхФорм.Форма.ФормаОбьектовМетаданных",, ЭтаФорма,,,, Оповещение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуМетаданныхЗавершение(Результат, Параметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ИсточникДанных = Результат;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМакет(Команда)
	
	Если Объект.Ссылка.Пустая() ИЛИ НЕ ЭтаФорма.ЕстьМакет Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстВопроса = "Текущий макет будет удален! Продолжить?";
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да);
	Кнопки.Добавить(КодВозвратаДиалога.Нет);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеНаВопросОбУдаленииМакета", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросОбУдаленииМакета(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		УдалитьМакетНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМакетНаСервере()
	
	Успешно = Истина;
	
	Набор = РегистрыСведений.смартДополнительныеДанныеОбъектов.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(Объект.Ссылка, Истина);
	Набор.ОбменДанными.Загрузка = Истина;
	
	Попытка
		Набор.Записать(Истина);
	Исключение
		Успешно = Ложь;
	КонецПопытки;	

	Если Успешно Тогда

		Объект.ИмяФайлаМакета = "";
		Объект.ДатаИзменения = Неопределено;

		Модифицированность = Истина;
		
		ВывестиДанныеМакетаНаСервере();

		ОбщегоНазначения.СообщитьПользователю("Макет удален");

	Иначе

		ОбщегоНазначения.СообщитьПользователю("Не удалось удалить макет!");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ТабличныйДокумент"
		ИЛИ ИмяСобытия = "Запись_ОфисныйДокумент" Тогда
		
		ЗаполнитьСписокПараметровМакетаСервер();
		ЗаполнитьСписокОбластейМакетаСервер();

		Объект.ДатаИзменения = ТекущаяДата();

		Модифицированность = Истина;

		ВывестиДанныеМакетаНаСервере();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипМакетаПриИзменении(Элемент)
	
	ТекстВопроса = "При изменении типа макета сохраненный макет будет удален! Продолжить?";
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да);
	Кнопки.Добавить(КодВозвратаДиалога.Нет);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеНаВопросОбИзмененииТипаМакета", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки);

КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросОбИзмененииТипаМакета(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ТекущийТипМакета = Объект.ТипМакета;

		УдалитьМакетНаСервере();
		
	Иначе

		Объект.ТипМакета = ТекущийТипМакета;		
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаРеквизитИмяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СсылкаНаОбъектМетаданных = Объект.ИсточникДанных;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектМетаданных", СсылкаНаОбъектМетаданных);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораРеквизитаЗавершение", ЭтаФорма, Параметры);
	
	ОткрытьФорму("Обработка.смартДеревоРеквизитовОбъекта.Форма", ПараметрыФормы,ЭтаФорма,,,, Оповещение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораРеквизитаЗавершение(Результат, Параметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Если НЕ Результат.ЭтоТабличнаяЧасть Тогда
		Элементы.ПараметрыШаблона.ТекущиеДанные.РеквизитИмя = Результат.ПолноеИмяРеквизита;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо выбирать реквизит, а не табличную часть!";
		Сообщение.Сообщить(); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрВложенногоМодуляНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СсылкаНаОбъектМетаданных = Объект.ИсточникДанных;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектМетаданных", СсылкаНаОбъектМетаданных);
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВыбораПараметрВложенногоМодуляЗавершение", ЭтаФорма, Параметры);
	
	ОткрытьФорму("Обработка.смартДеревоРеквизитовОбъекта.Форма", ПараметрыФормы,ЭтаФорма,,,, Оповещение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораПараметрВложенногоМодуляЗавершение(Результат, Параметры) Экспорт

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Если НЕ Результат.ЭтоТабличнаяЧасть Тогда
		Объект.ПараметрВложенногоМодуля = Результат.ПолноеИмяРеквизита;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо выбирать реквизит, а не табличную часть!";
		Сообщение.Сообщить(); 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаФорматНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПолеДанных 		= "Формат";
	ПолеЭлемента 	= "ПараметрыШаблона";
	ИмеетсяЗначение = Элементы.ПараметрыШаблона.ТекущиеДанные.Формат;
	
	ВызватьКонструкторФорматнойСтроки(ПолеЭлемента, ПолеДанных, ИмеетсяЗначение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьКонструкторФорматнойСтроки(ПолеЭлемента, ПолеДанных, ИмеетсяЗначение)
	
	Конструктор = Новый КонструкторФорматнойСтроки;
	Конструктор.ДоступныеТипы = Новый ОписаниеТипов("Число, Дата, Булево");
	Конструктор.Текст = ИмеетсяЗначение;
	
	ДополнительныеПараметры = Новый Структура("ПолеЭлемента, ПолеДанных", ПолеЭлемента, ПолеДанных);
	
	Оповещение = Новый ОписаниеОповещения("ВызватьКонструкторФорматнойСтрокиЗавершение", ЭтаФорма, ДополнительныеПараметры); 
	
	Конструктор.Показать(Оповещение);
	
КонецПроцедуры	

&НаКлиенте
Процедура ВызватьКонструкторФорматнойСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
	
		Элементы[ДополнительныеПараметры.ПолеЭлемента].ТекущиеДанные[ДополнительныеПараметры.ПолеДанных] = Результат;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыШаблонаПараметрШаблонаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	СписокРеквизитов = ПолучитьСписокНеСопоставленныхПараметров();
	
	Элемент.СписокВыбора.Очистить();
	
	Для Каждого ЭлПараметр Из СписокРеквизитов Цикл
		Элемент.СписокВыбора.Добавить(ЭлПараметр.Значение);
	КонецЦикла;
	
	ОповещениеВыбораИзСписка = Новый ОписаниеОповещения("ПослеВыбораПараметраШаблона", ЭтаФорма);
	
	ПоказатьВыборИзСписка(ОповещениеВыбораИзСписка, Элемент.СписокВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПараметраШаблона(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда

		Элементы.ПараметрыШаблона.ТекущиеДанные.ПараметрШаблона = Результат;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокНеСопоставленныхПараметров()
	
	СписокНеСопоставленных = Новый СписокЗначений;
	
	Если Объект.СписокПараметровМакета.Количество() = 0 Тогда
		
		ЗаполнитьСписокПараметровМакетаСервер();
		
	КонецЕсли;
	
	Для Каждого СтрокаП Из Объект.СписокПараметровМакета Цикл
		
		ОтборПараметр = Новый Структура("ПараметрШаблона", СтрокаП.Параметр);
		
		СтрокиПараметрыШаблона = ?(Объект.ПараметрыШаблона.НайтиСтроки(ОтборПараметр).Количество() > 0, Истина, Ложь);
		
		Если НЕ СтрокиПараметрыШаблона Тогда
			СписокНеСопоставленных.Добавить(СтрокаП.Параметр);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокНеСопоставленных;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокПараметровМакетаСервер()

	Элементы.ПараметрыШаблонаПараметрШаблона.СписокВыбора.Очистить();
	
	Объект.СписокПараметровМакета.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;	
	
	МакетМодуля = смартСерверПривилегированный.ПолучитьДополнительныеДанныеОбъекта(Объект.Ссылка);
	
	Если МакетМодуля = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	Если Объект.ТипМакета = "MXL" Тогда
		КоллекцияИменПараметров = смартШаблоныПечатныхФормСервер.ИменаПараметровТабличногоДокумента(МакетМодуля);
	ИначеЕсли Объект.ТипМакета = "DOCX" Тогда
		КоллекцияИменПараметров = смартШаблоныПечатныхФормСервер.ИменаПараметровДокументаWord(МакетМодуля);
	Иначе
		Возврат;
	КонецЕсли;	

	Для Каждого Элемент Из КоллекцияИменПараметров Цикл
		
		НовПараметр = Объект.СписокПараметровМакета.Добавить();
		
		НовПараметр.Параметр = Элемент.Значение;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбластейМакетаСервер()

	Объект.СписокОбластейМакета.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;	
	
	МакетМодуля = смартСерверПривилегированный.ПолучитьДополнительныеДанныеОбъекта(Объект.Ссылка);
	
	Если МакетМодуля = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	КоллекцияИменОбластей = Новый Массив;
	
	Если Объект.ТипМакета = "MXL" Тогда
		
		Для Каждого СтрОбласти Из МакетМодуля.Области Цикл
			
			НоваяОбласть = Объект.СписокОбластейМакета.Добавить();
			НоваяОбласть.Область = СтрОбласти.Имя;
			
		КонецЦикла;	

	ИначеЕсли Объект.ТипМакета = "DOCX" Тогда

		МакетWord = смартУправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетМодуля, "");
		
		Для Каждого СтрОбласти Из МакетWord.СтруктураДокумента.ОбластиДокумента Цикл

			НоваяОбласть = Объект.СписокОбластейМакета.Добавить();
			НоваяОбласть.Область = СтрОбласти.Ключ;
			
		КонецЦикла;	
		
		смартУправлениеПечатью.ОчиститьСсылки(МакетWord);
		
	КонецЕсли;	

	Для Каждого Элемент Из КоллекцияИменОбластей Цикл
		
		НовПараметр = Объект.СписокПараметровМакета.Добавить();
		
		НовПараметр.Область = Элемент;
		
	КонецЦикла;
	
	ЗаполнитьСписокВыбораОбластей();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораОбластей()

	МассивОбластей = Новый Массив;
	
	Для Каждого СтрОбласть Из Объект.СписокОбластейМакета Цикл
		МассивОбластей.Добавить(СтрОбласть.Область);
	КонецЦикла;

	Элементы.ОбластиШаблонаОбластьШаблона.СписокВыбора.ЗагрузитьЗначения(МассивОбластей);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПараметрыШаблонаПроизвольныйКодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ПолеДанных 		= "ПроизвольныйКод";
	ПолеЭлемента 	= "ПараметрыШаблона";
	ИмеетсяЗначение = Элементы.ПараметрыШаблона.ТекущиеДанные.ПроизвольныйКод;
	
	ВызватьФормуРедактированияПроизвольногоКода(ПолеЭлемента, ПолеДанных, ИмеетсяЗначение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластиШаблонаУсловиеВыводаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ПолеДанных 		= "УсловиеВывода";
	ПолеЭлемента 	= "ОбластиШаблона";
	ИмеетсяЗначение = Элементы.ОбластиШаблона.ТекущиеДанные.УсловиеВывода;
	
	ВызватьФормуРедактированияПроизвольногоКода(ПолеЭлемента, ПолеДанных, ИмеетсяЗначение);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВызватьФормуРедактированияПроизвольногоКода(ПолеЭлемента, ПолеДанных, ИмеетсяЗначение)
	
	ДополнительныеПараметры = Новый Структура("ПолеЭлемента, ПолеДанных", ПолеЭлемента, ПолеДанных);
	ПараметрыФормы 			= Новый Структура("ТекстКода", ИмеетсяЗначение);
	
	Оповещение = Новый ОписаниеОповещения("ВызватьФормуРедактированияПроизвольногоКодаЗавершение", ЭтаФорма, ДополнительныеПараметры); 
	
	ОткрытьФорму("Справочник.смартМодулиПечатныхФорм.Форма.ФормаРедактированияПроизвольногоКода", ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры	

&НаКлиенте
Процедура ВызватьФормуРедактированияПроизвольногоКодаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
	
		Элементы[ДополнительныеПараметры.ПолеЭлемента].ТекущиеДанные[ДополнительныеПараметры.ПолеДанных] = Результат;
		
		Модифицированность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьМакет(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала нужно записать макет!");
		Возврат;
	КонецЕсли;	
	
	ТекстВопроса = "Текущий макет будет заменен! Продолжить?";
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да);
	Кнопки.Добавить(КодВозвратаДиалога.Нет);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеНаВопросОКопированииМакета", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросОКопированииМакета(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
		
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриВыбореМодуляКопирования", ЭтаФорма, "ПодборМодуля");
		
		ОткрытьФорму("Справочник.смартМодулиПечатныхФорм.ФормаВыбора", ПараметрыФормы, ЭтаФорма, ,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореМодуляКопирования(Значение, ДопПараметры) Экспорт

	Если Значение = Неопределено Тогда
        Возврат;
    КонецЕсли;
     
    СкопироватьМакетНаСервере(Значение);

	ОбщегоНазначенияКлиент.СообщитьПользователю("Макет скопирован из модуля """ + СокрЛП(Значение) + """");
	
КонецПроцедуры	
	
&НаСервере
Процедура СкопироватьМакетНаСервере(СсылкаКопирования)

	ИсходнаяЗапись = РегистрыСведений.смартДополнительныеДанныеОбъектов.СоздатьМенеджерЗаписи();
	ИсходнаяЗапись.Объект = СсылкаКопирования;
	ИсходнаяЗапись.Прочитать();

	Если ИсходнаяЗапись.Выбран() Тогда
		
		Успешно = Истина;
		
	    НоваяЗапись = РегистрыСведений.смартДополнительныеДанныеОбъектов.СоздатьМенеджерЗаписи();
	    НоваяЗапись.Объект = Объект.Ссылка;
	    НоваяЗапись.Данные = ИсходнаяЗапись.Данные;
		
		Попытка
	    	НоваяЗапись.Записать(Истина);
		Исключение
			Успешно = Ложь;
		КонецПопытки;	

		Если Успешно Тогда
			
			Объект.ДатаИзменения = ТекущаяДата();
			
			Если Объект.ТипМакета = "DOCX" Тогда
				Объект.ИмяФайлаМакета = СсылкаКопирования.ИмяФайлаМакета;
			КонецЕсли;	

			ВывестиДанныеМакетаНаСервере();

			Модифицированность = Истина;
			
		КонецЕсли;		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМакет(Команда)

	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала нужно записать макет!");
		Возврат;
	КонецЕсли;	
	
	ТекстВопроса = "Текущий макет будет заменен! Продолжить?";
	
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(КодВозвратаДиалога.Да);
	Кнопки.Добавить(КодВозвратаДиалога.Нет);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеНаВопросОЗагрузкеМакета", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки);

КонецПроцедуры

&НаКлиенте
Процедура ПриОтветеНаВопросОЗагрузкеМакета(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выберите файл docx";
		Диалог.ПолноеИмяФайла = ""; 
		Диалог.Фильтр = "docx (*.docx)|*.docx"; 
		Диалог.МножественныйВыбор = Ложь;

		Если Диалог.Выбрать() Тогда
			
			ПриВыбореФайлаМакетаДляЗагрузки(Диалог.ПолноеИмяФайла, Диалог.Каталог);

		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореФайлаМакетаДляЗагрузки(ПолноеИмяФайла, Каталог) Экспорт

	Если ПолноеИмяФайла = Неопределено Тогда
        Возврат;
    КонецЕсли;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтаФорма.УникальныйИдентификатор);
 
	Если ЗагрузитьМакетНаСервере(АдресФайла) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Макет загружен из файла """ + СокрЛП(ПолноеИмяФайла) + """");
		
		ЗаполнитьСписокПараметровМакетаСервер();
		ЗаполнитьСписокОбластейМакетаСервер();
		
		Объект.ИмяФайлаМакета = СтрЗаменить(ПолноеИмяФайла, Каталог, "");

		ВывестиДанныеМакетаНаСервере();

		Модифицированность = Истина;
		
	Иначе	
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка загрузки макета """ + СокрЛП(ПолноеИмяФайла) + """");
		
	КонецЕсли;	
	
КонецПроцедуры	
	
&НаСервере
Функция ЗагрузитьМакетНаСервере(АдресФайла)
	
	Результат = Ложь;
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайла);
	
	Если ДанныеФайла <> Неопределено Тогда
		
		Попытка
			смартСерверПривилегированный.ЗаписатьДополнительныеДанныеОбъекта(Объект.Ссылка, ДанныеФайла);
			Результат = Истина;
		Исключение
		КонецПопытки;	
		
	КонецЕсли;
	
	Если Результат Тогда

		Объект.ДатаИзменения = ТекущаяДата();

		Модифицированность = Истина;
		
	КонецЕсли;		
	
	Возврат Результат;	
	
КонецФункции
